// dictionary.js

'use strict';

const dictionary = {
  Абьюзер:
    '(от англ. Abuse – оскорбление) человек, который пользуется другими в отношениях, унижая и принуждая их делать что-то вопреки их желаниям. Из-за невзаимной любви он стал абьюзером в отношениях.',
  Агриться:
    '(от англ. Argue — ругаться) испытывать чувство злобы к определенной ситуации.  Мама агрилась на сына за то, что он не выполнил её просьбу.',
  Анбоксинг:
    '(от англ. Unboxing — распаковка) процесс, записываемый на видео, в котором люди распаковывают посылки (как правило используется блогерами).  Сегодня будет анбоксинг посылки из Китая.',
  Байтить:
    'провоцировать. Происходит от to bite — укусить. Когда он снова будет вам дерзить, охладите его веским: «Хорош меня байтить».',

  Бро: 'брат. Происходит от слова «brother» (англ.яз).',

  Буллинг:
    '(от англ. Bulling — травля) травля и осуждение человека полюбому поводу. Артёма всегда буллили за яркую родинку на правой щеке.',

  Бумер:
    '(от англ. Boomer — человек, создающий шумиху вокруг чего-либо)так называют людей от 40 лет, не желающих воспринимать современные реалии.',
  Бэнгер: 'музыкальный суперхит, от англ.bang-(взрыв).',
  Бэсти: '(от англ. best) лучший друг, подруга.',
  Вайб: 'атмосфера, настроение. Англицизм - калька слова vibe (вибрация),сначала так стали говорить эзотерики о позитивных вибрациях, а затем слово перекочевало к молодёжи. Например, «он своим появлением сломал вайб» — испортил общую атмосферу в компании.',
  Варик:
    'вариант. Простое сокращение, которое мы узнаём и в словах «мультик», «кондер», «комп».',
  Войсить:
    'записывать голосовые сообщения, от англ. voice (голос). Относится к любым аудиосообщениям в соцсетях и мессенджерах.',
  Гёрла: 'девочка (от английского girl-девочка).',
  Гоу: '(от английского go — пойдём) — иногда сокращается как «го». Так говорят, когда хотят позвать кого-то куда-то. Например, «гоу в магазин».',
  Дэнсить: 'танцевать, от английского слова «dance».',
  Задонатить:
    'пожертвовать, от английского donate (пожертвование). Означает пополнение своего мобильного счёта, оплату подписки на какой-то сервис, покупку чего-либо в компьютерных играх. Иногда используется для обозначения любой покупки. Производное — донат (оплата).',
  Ивейтить: '(от англ. Еvade — уклоняться) уклоняться.',
  Изи: 'легко, тоже англицизм. Происходит от easy — легко, без труда. Пример: «Экзамен просто изи».',
  Камон:
    '(от английского come on — давай уже, да ладно) — слово, в зависимости от контекста означающее либо побуждение что-то сделать, либо недовольство: «камон, мы и правда туда пойдём?».',
  Комп: 'от слова «computer».',
  Краш: 'предмет тайной или безответной влюблённости, а иногда просто про того, кто нравится. Crush родом из английского языка, но это не «разрушать» или «раздавить», а «увлечение» — другое, менее распространённое значение. Хотя и основной смысл слова тоже неплохо подходит, ведь «крашем» часто называют того, с кем всё совершенно безнадёжно.',
  Кринж:
    'знакомый нам «испанский стыд». Это калька с глагола to cringe — «поёживаться». Он ведёт себя кринжово, то есть заставляет других испытывать неловкость за своё поведение. Уверены, что такое поведение со стороны вашего подростка вам знакомо. Но и он о вас так думает, так что вы квиты.',
  Криповый:
    'пугающий, ужасный. От creepy — бросающий в дрожь, жуткий (англ.), используется для обозначения крайней степени ужаса, такой, что вызывает мурашки и приподнимает волосы на голове. Хэллоуин на носу: вверните это словцо по случаю.',
  Кульно: 'от слова «cool», круто.',
  Кэш: 'от слова «сash», наличные деньги.',
  Лайк: '(от английского like — нравиться) — это выражение одобрения в соцсетях, которое постепенно перешло и в жизнь. Так, если вашему наряду сказали «лайк», значит человеку нравится ваш образ.',
  Ливнуть:
    '(от английского leave — уйти) — означает покинуть что-либо: место, чат или онлайн-игру.',
  Лойс: 'это то же, что и «лайк», но искажённая версия.',
  Локдаун: '(от англ. Lockdown — карантин) строгий запрет на что-либо.',
  Мерч: 'от англ. merchandise (выпуск атрибутики для истинных фанатов), Любые предметы с символом какой-то публичной персоны или знакового проекта.',
  Муд: '(от английского mood — настроение) — переводится буквально: настроение.',
  Олд: '(от английского old — старый) — так называют всех, кому «за», проще говоря, всех, кого подростки считают старыми (это могут быть и двадцатилетние). Олдами (ударение на а) считают людей с устаревшими взглядами на жизнь, которые любят предаваться ностальгии и считают, что «раньше было лучше».',
  Пруф: 'подтверждение, доказательство, калька с proof (доказательство, англ.). В Сети часто просят предоставить пруфы, то есть подтвердить сказанные слова фактами, документами. Если он говорит вам, что получил пятёрку или сдал зачёт, требуйте пруф — как бы его слова не оказались кринжовым пранком.',
  'Рил ток': '(инфа сотка)- от англ. real talk; Достоверно, «отвечаю!».',
  Рофл: '(рофлить) — громко смеяться. Аббревиатура Rolling On the Floor Laughing — «катаясь по полу от смеха», обычно используется как описание чего-то гомерически смешного, но в определённом контексте может значить издёвку или насмешку — рофлить над кем-то.',
  Свайп: 'от англ. Swipe, смахнуться, переключиться.',
  Скилл: 'навык, способность.',
  Скипнуть: 'пропустить.',
  Слэм: 'толкотня на концерте, физический контакт между людьми в толпе для выражения эмоций.',
  Сорян:
    'также используется «сорри». Так говорят, если хотят извиниться за что-то.',
  Стримить:
    'снимать видео в режиме реального времени, общаясь со зрителями в чате.',
  Токсик:
    'токсичный человек. Произошло от toxic (ядовитый, англ.), кстати, в 2018 году Оксфордский словарь назвал toxic словом года, им заинтересовалось наибольшее количество людей. Так говорят о человеке, который пытается отравить жизнь других словами или делами.',
  Трабл: 'проблема, сложная задача.',
  Тюбик:
    'неспортивный худой парень 18–25 лет. Раньше таких молодых людей назвали бы хлюпиками. Они часто носят одежду оверсайз, кепки, длинные волосы. Так говорят и про инфантильных ребят, которые мало приспособлены к жизни, но любят покрасоваться на публике. Впрочем, прозвище не считается оскорблением — это, скорее, ирония.',
  Флексить:
    'хвалиться, выпендриваться. Это слово успело поменять значение всего за год. Изначально флексить от to flex (изгибать, шевелить, англ.) означало определённый стиль клубных движений, а затем переродилось в более неприятное — кичиться одеждой, стилем поведения, деньгами, потому что в клубе молодёжь постоянно пытается выделиться из толпы.',
  Хейтить:
    'открыто ненавидеть кого-то или что-то, проявлять эту эмоцию, травить словами — устно или письменно. Калька с hate — ненависть (англ.) Хейтят обычно в онлайн-пространстве, выбирая для проявления своих чувств комментарии, ЛС или общение в чате.',
  Чилить:
    'отдыхать. Слово пришло из английского языка, chill (прохлада) навевает мысли о расслабленном отдыхе в чилаутах ночного клуба.',
  Читер:
    'игрок, использующий чит-коды в компьютерных играх, в широком смысле жулик, мошенник.',
  Чекать: 'проверять, от to check — проверять, англ.',
  Челендж: 'соревнование, брошенный вызов.',
  Шеймить:
    'пристыдить кого-либо. Как и большинство слов в подборке, пришло из английского языка и практически не изменилось — shame (позор, стыд). Шейм не такой агрессивный, как хейт и буллинг, это, скорее, цоканье языком, чем пощёчина. Теперь у вас есть целая градация схожих смыслов для вечернего семейного разноса.',
  Шипперить:
    'представлять, воображать отношения между персонажами/кумирами/знакомыми, заниматься сводничеством. Слово пошло от части английских слов, обозначающих отношения, — friendship (дружба), relationship (отношения).',
  // Добавьте остальные слова и их значения
};
